{
    "name": "Biology",
    "course_catalog_url": "https://mycatalog.txstate.edu/courses/bio/",
    "courses": [
        {
            "course_code": "BIO 1130",
            "course_name": "Functional Biology Laboratory",
            "course_desc": "Fundamental techniques and instruments used in cellular biological research will be taught while emphasizing safety, measurements, and scientific methods. Students will design and implement controlled experiments, identify independent and dependent variables, analyze data, draw conclusions, and communicate results with appropriate tables and graphs in oral presentations and written papers.",
            "course_credits": "\n1 Credit Hour \n0 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 1131",
            "course_name": "Organismal Biology Laboratory",
            "course_desc": "This course introduces the students to the basics of experimental design, scientific method and inquiry, use of statistical analyses and writing research papers. Topics covered include Mendelian and population genetics, natural selection, population ecology, phylogeny, and behavioral ecology.",
            "course_credits": "\n1 Credit Hour \n0 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 1320",
            "course_name": "Modern Biology I, Molecules, Cells, and Physiology",
            "course_desc": "Provides students with basic scientific and biological principles. Current problems in biology and the ethics of science are presented with perspectives of public policy from a scientific viewpoint.  This course is not recommended for majors in the natural sciences, including biology.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Life & Phys Sciences Core 030|Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 1321",
            "course_name": "Ecology, Evolution and Society",
            "course_desc": "This course provides the non-science major an overview of the ecological and evolutionary principles that govern relationships between living organisms, including humans, and their environment. Special attention is given to environmental issues of current concern, such as overpopulation, climate change, pollution, resource depletion, and conservation biology.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n1 Lab Contact Hour\n",
            "course_attributes": "Course Attribute(s): Life & Phys Sciences Core 030|Dif Tui- Science & Engineering|Multicultural Perspective",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 1330",
            "course_name": "Functional Biology",
            "course_desc": "This course provides the students with a strong foundation in cellular and molecular biology. Topics include biochemistry, energy metabolism, molecular bases of gene regulation and protein functions, cell division and control, and cell signaling. This course is required for all biology majors and is not recommended for non-science majors. Prerequisite: College Readiness in English Language Arts and Reading (ELAR) according to the TSI regulations.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Life & Phys Sciences Core 030|Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 1331",
            "course_name": "Organismal Biology",
            "course_desc": "This course provides science majors with a foundation in organismal biology, Mendelian and population genetics, evolution and ecology. Topic include: patterns of inheritance, genetics, evolution, speciation, phylogenetics, and behavioral population, community, and ecosystem ecology. This course is required for all biology majors and is not recommended for non-science majors. Prerequisite: College Readiness in English Language Arts and Reading (ELAR) according to the TSI regulations and College Readiness in Mathematics according to the TSI regulations.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Life & Phys Sciences Core 030|Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 2400",
            "course_name": "Microbiology",
            "course_desc": "Principles of microbiology, morphology, anatomy, physiology and taxonomy of representative groups of non-pathogenic organisms. Laboratory methods stress studies of pure cultures, the use of laboratory apparatus in quantitative determinations and the detection and identification of microbial populations in the environment. Prerequisites: BIO 1130 and BIO 1131 and BIO 1330 and BIO 1331 and CHEM 1341 all with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 2410",
            "course_name": "Intermediate General Botany",
            "course_desc": "An introduction to the biology of plants and plant-like organisms, emphasizing their role in ecosystem processes, relationships between structure and function, and the evolutionary relationships among the major plant groups. Prerequisites: BIO 1130 and BIO 1131 and BIO 1330 and BIO 1331 all with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 2411",
            "course_name": "Intermediate Zoology",
            "course_desc": "Provides biology majors a strong foundation in animal biology at the organismal level. The format will include details of animal form and function as well as concepts relating to classification, phylogeny, evolution, and ecology. Topics will include natural history, biogeography, adaptations to local environments, shared characters, and behavior. All material is presented in an accepted phylogenetic sequence. Prerequisites: BIO 1130 and BIO 1131 and BIO 1330 and BIO 1331 all with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 2430",
            "course_name": "Human Physiology and Anatomy",
            "course_desc": "A course on human physiology covering the various organ systems. Principles of molecular biology, cell and tissue structure, anatomy and relationship of structure and function are stressed. May not be credited toward a Biology major or minor.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n4 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 2440",
            "course_name": "Principles of Microbiology",
            "course_desc": "The Basic Principles of microbiology, morphology, physiology, immunology and the relationship of microorganisms to diseases. This course is designed primarily to meet the requirements for students in allied health sciences and other programs requiring only one semester of microbiology. This course may not be credited toward a biology major or minor.  Prerequisites: BIO 1330 and CHEM 1341 both with grades of \"D\" or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 2450",
            "course_name": "Genetics",
            "course_desc": "An introduction to basic principles of Genetics by studies of Mendelian, molecular, quantitative and population genetics. Topics include: classical transmission genetics, and gene mapping, DNA replication and repair, transcription, translation, control of gene expression, genetic engineering techniques, Hardy-Weinberg equilibrium, evolutionary change via natural selection, and genetic drift. Prerequisites: BIO 1130 and BIO 1131 and BIO 1330 and BIO 1331 and CHEM 1141 and CHEM 1142 and CHEM 1341 and CHEM 1342 all with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 2451",
            "course_name": "Human Anatomy and Physiology I",
            "course_desc": "Part I of a two semester course on the structure and function of the human body. Designed specifically to prepare students for nursing and other health professions. Prerequisites: BIO 1330 and CHEM 1341 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n2 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 2452",
            "course_name": "Human Anatomy and Physiology II",
            "course_desc": "This course is the second part of a two semester course on the structure and function of the human body designed specifically to prepare students for nursing and other health professions. Prerequisites: BIO 1330 and BIO 2451 and CHEM 1341 all with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n2 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3200",
            "course_name": "Genetic Engineering Technology",
            "course_desc": "This course introduces the technologies used for genetic engineering with an emphasis on the CRISPR-Cas system. Students will examine various applications in medicine, agriculture, and biotechnology and evaluate the potential benefits and problems, including the underlying technological, ethical and safety concerns.  Students will gain hands-on experience tagging genes in the model nematode worm, Caenorhabditis elegans. Prerequisite: BIO 2450 with a grade of \"C\" or better.",
            "course_credits": "\n2 Credit Hours \n1 Lecture Contact Hour \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3210",
            "course_name": "Biology Pedagogy and Learning",
            "course_desc": "This course provides an introduction to pedagogical ideas relevant to the teaching and learning of biology for biology learning assistants. Students will learn key education theories and methods from STEM education research and cognitive science. Students will evaluate the processes of teaching and learning and examine structures and practices that facilitate and/or inhibit student learning. Students will apply what they've learned to the teaching of biology as they collaborate with biology faculty as learning assistants for an undergraduate biology course and complete a final project.  Prerequisite: Department approval.",
            "course_credits": "\n2 Credit Hours \n2 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3300",
            "course_name": "Cell and Molecular Biology",
            "course_desc": "Fundamentals of structure and function of prokaryotic and eukaryotic cells. This course includes cell and organelle structure, basic biochemistry, principles of thermodynamics and energy transformation, nucleic acid and protein synthesis, enzyme kinetics, cell motility and cell signaling. Prerequisites:  BIO 2450 with a grade of C or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3301",
            "course_name": "Biology of Sex and Reproduction",
            "course_desc": "This course focuses on animals, especially vertebrates, and covers topics such as the evolution of sexual reproduction, genetic variation, sex differentiation during development, reproductive anatomy and physiology, reproductive endocrinology, gestation, disease transmission, and reproductive technologies. Prerequisite: BIO 2450 with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3308",
            "course_name": "Global Ecology",
            "course_desc": "An interdisciplinary introduction to the science of global environmental change. Emphasis will be placed on understanding principles of earth system science, the scientific basis underlying the major components of global environmental change, the linkages between these components, and the central role of humanity in contributing to the observed changes. (WI) Prerequisites: BIO 1130 and BIO 1131 and BIO 1330 and BIO 1331 all with grades of C or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3341",
            "course_name": "Aquatic Toxicology",
            "course_desc": "This course examines the basic concepts of aquatic toxicology, including uptake mechanisms, interactions, and elimination of different toxicants. Students will understand how toxic substances impact freshwater and marine organisms and identify potential health impacts to humans. Topics to be discussed include nutrients, metals, oil, pesticides, radionuclides, plastics, and emerging contaminants. Prerequisites: BIO 1331 and CHEM 1341 both with grades of C or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3371",
            "course_name": "Marine Resources",
            "course_desc": "This course examines the exploitation and fragility of the marine environment and the economic importance of marine resources. Topics to be examined include ocean ownership, overfishing, aquaculture, shark finning, whaling, ocean mining, marine transportation, tourism, pollution, harvesting energy from the ocean, and the importance of creating marine reserves. Prerequisite: BIO 1331 with a grade of C or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3376",
            "course_name": "Introduction to Biotechnology",
            "course_desc": "This course is an introduction to biotechnology. It provides an insight into how biotechnological applications can solve scientific and societal problems for the benefit of humankind. Prerequisite: BIO 1330 and BIO 1331 both with grades of \"D\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3406",
            "course_name": "Economic Botany",
            "course_desc": "An introduction to the utilization of plants by humans and their economic and ecological significance. Laboratories will stress plant features beneficial to economic and societal needs. Prerequisite: BIO 2450 with a grade of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3421",
            "course_name": "Vertebrate Physiology",
            "course_desc": "The study of the physiology of vertebrate organ systems, including the nervous system, musculoskeletal system, endocrine system, cardiovascular system, respiratory system, digestive system, reproductive system and urinary system. Mammalian systems will be emphasized. Prerequisite: BIO 2450 with a grade of \"C\" or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3425",
            "course_name": "Human Anatomy",
            "course_desc": "This course introduces students to the anatomy of the human body. Aspects of both gross and micro anatomy of tissues, organs, and systems will be covered with an emphasis on hands-on laboratory exploration. This course is designed for students interested in a variety of health professions. Prerequisite: BIO 1330 and BIO 1130 and BIO 1331 and BIO 1131 and CHEM 1341 and CHEM 1141 and CHEM 1342 and CHEM 1142 all with grades of \"C\" or better.",
            "course_credits": "\n4 Credit Hours \n2 Lecture Contact Hours \n4 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3426",
            "course_name": "Human Physiology",
            "course_desc": "This course focuses on human physiology and covers topics such as the nervous system, muscular system, endocrine system, cardiovascular system, respiratory system, digestive system, exocrine system, and reproductive system.  Prerequisite: BIO 2450 with a grade of \"C\" or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3430",
            "course_name": "Mycology",
            "course_desc": "A study of the fungal kingdom including slime molds and lichens. Laboratory studies will emphasize taxonomy, morphology and culture techniques. Prerequisites: [BIO 2400 or BIO 2410] and BIO 2450 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n2 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3442",
            "course_name": "Virology",
            "course_desc": "The structure, multiplication and genetics of bacterial, plant, and animal viruses. The role of viruses in human and plant disease. (WI) Prerequisites: BIO 2400 and BIO 2450 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n4 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3460",
            "course_name": "Aquatic Ecology",
            "course_desc": "An introduction to the diversity and ecology of aquatic organisms. Students will learn to use ecological concepts to understand aquatic ecosystems and how they are impacted by human activities. They will also summarize and extract relevant information from scientific papers in aquatic ecology, analyze collected data, and communicate the results effectively. The laboratory sessions will include both lab and field work and at least a one-day field trip. Prerequisite: BIO 4416 with a grade of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3461",
            "course_name": "Plant Taxonomy",
            "course_desc": "Principles of identification and classification of plants; nomenclature and characteristics of various plant groups with emphasis on the higher plants. Prerequisite: BIO 2450 with a grade of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 3480",
            "course_name": "Histology",
            "course_desc": "A study of the structural and functional relationships between cells and tissues in organs. The laboratory includes the study of prepared slides and of microtechnique. This course is designed to meet the needs of pre-professional\nstudents. Prerequisite: BIO 2450 with a grade of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n4 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4126",
            "course_name": "Immunology Laboratory",
            "course_desc": "This laboratory-based course will cover cells of the immune system and basic serological reactions, including bacterial and viral agglutination reactions, precipitation, immunoelectrophoresis, immunofluorescence, and enzyme-linked immunosorbent assays. (WI) Prerequisite: BIO 2400 and BIO 2450 both with grades of \"C\" or better. Corequisite: BIO 4326 with a grade of \"C\" or better.",
            "course_credits": "\n1 Credit Hour \n0 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4166",
            "course_name": "Medical Microbiology Laboratory",
            "course_desc": "This laboratory-based course will cover pathogenic bacteria emphasizing identification of selected groups of pathogens and the biological basis for virulence. (WI) Prerequisites: BIO 2400 and BIO 2450 both with grades of \"C\" or better. Corequisites: BIO 4366.",
            "course_credits": "\n1 Credit Hour \n0 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4176",
            "course_name": "Microbial Biotechnology Laboratory",
            "course_desc": "This laboratory-based course will cover use of microbes for biotechnological applications and is designed to provide practical explorations into fields of biotechnology. Topics include laboratory techniques for recombinant protein purification, fermentation, identification of markers in genetically modified food and bioremediation of pollutants.  Prerequisite: BIO 2400 and BIO 2450 both with grades of \"C\" or better. Corequisite: BIO 4376.",
            "course_credits": "\n1 Credit Hour \n0 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4299",
            "course_name": "Undergraduate Research",
            "course_desc": "Supervised individual research projects in a mentor-student relationship with a biology professor. May be repeated once for credit. Prerequisites: BIO 2450 with a grade of C or better and a minimum 3.0 Texas State GPA and instructor approval.",
            "course_credits": "\n2 Credit Hours \n0 Lecture Contact Hours \n4 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4300",
            "course_name": "Neurobiology",
            "course_desc": "This course will give students an overview of neuroscience, particularly the areas of neuroanatomy, neurophysiology, and evolutionary and developmental neurobiology. Prerequisite: BIO 2450 with a grade of C or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4301",
            "course_name": "Evolution",
            "course_desc": "Basic genetic principles applied to natural selection, adaptation, populations, speciation and mans future. Consideration is given to the origin of life, nature\nof chromosomal variation, evolution of genetic systems and certain other selected topics. Prerequisite: BIO 2450 with a grade of C or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4304",
            "course_name": "Wildlife and Recreation: Impact, Policy, and Management",
            "course_desc": "Students will be introduced to the impact human recreational activities have on wildlife habitats and populations. Management practices to enhance human-wildlife\nencounters or to minimize detrimental effects on wildlife populations will be presented. Prerequisite: BIO 4416 with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4305",
            "course_name": "Nature Study",
            "course_desc": "This course provides a comprehensive survey of natural events.  It includes laboratory and field work emphasizing observation, collection and discovery of relationships. It is creditable only for those seeking elementary or middle school certification and is required for those seeking grade 4-8 Science or Science/Mathematics teaching certification.  This course must be taken the semester immediately prior to student teaching.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4307",
            "course_name": "Ecology of Rarity",
            "course_desc": "This course will examine the ecology of rarity and its ability to inform public awareness and environmental policy. This course will explore how we define rarity, persistence and viability and address the question, \"Is rarity more or less common than might be expected, and is there anything we can or should do about it?\" Prerequisite: BIO 4416 with a grade of \"D\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4311",
            "course_name": "Cancer Biology",
            "course_desc": "Cancer Biology provides a foundation for understanding the complex molecular, biochemical, and cellular processes associated with cancer development. Topics include the role of tumor suppressor genes, oncogenes, DNA repair, apoptosis, ECM, cell-cycle control, cell signaling pathways, immune function and cancer-causing viruses. Emerging diagnostics and/or therapeutics will also be discussed. Prerequisite: BIO 2450 with a grade of \"C\" or better or instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4317",
            "course_name": "Interpretive Biology Programming and Design",
            "course_desc": "In this course, students will explore the methods and principles used by the National Park Service, museums, environmental centers, and state park systems to interest a variety of audiences as well as interpret biology and natural environments effectively. Students will practice skills in both personal and non-personal interpretation by creating science outreach programs, interpretive literature, brochures, path waysides, and other interpretive media. Service-learning is an integral and mandatory part of this course. (WI) Prerequisite: [BIO 2410 or BIO 2411] and BIO 2450 with grades of \"D\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4319",
            "course_name": "Biological Resources: Conservation and Planning",
            "course_desc": "This course is an introduction to the protection and sustainable use of populations, species, habitats, and ecosystems.  Course also includes study of the methods used to analyze biodiversity and population regulation. Corequisite: BIO 4416 with a grade of \"D\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4324",
            "course_name": "Natural History and Conservation of Large Mammals",
            "course_desc": "This course will introduce students to advanced details of natural history, research, and conservation of large mammals. Topics considered will include natural history, range and population status (historic and current), importance to and interaction with humans, research design and analysis, and the development of conservation and management plans.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4326",
            "course_name": "Immunology",
            "course_desc": "This lecture-based course will cover the biology of the immune system and its relationship to disease, emphasizing B and T cell immunity, immune diseases, hypersensitivities, transplantation, and cancer. (WI) Prerequisite: BIO 2400 and BIO 2450 both with grades of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4327",
            "course_name": "Issues in Irish Biodiversity and Conservation",
            "course_desc": "In this course, students will learn about Irish flora and fauna, ecosystems, conservation strategies in areas of high ecological concern, and public involvement. Emphasis will be placed on case studies and service-learning opportunities. Prerequisite: BIO 1131 and BIO 1331 both with grades of \"D\" or better and instructor approval. Corequisite: BIO 4328 with a grade of \"D\" or better.",
            "course_credits": "\n3 Credit Hours \n1 Lecture Contact Hour \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4328",
            "course_name": "Field Biology of Ireland",
            "course_desc": "In this course, students will use multiple techniques to explore biodiversity across multiple ecosystems in Ireland. Prerequisite: BIO 1131 and BIO 1331 both with grades of \"D\" or better and instructor approval. Corequisite: BIO 4327 with a grade of \"D\" or better.",
            "course_credits": "\n3 Credit Hours \n0 Lecture Contact Hours \n12 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4329",
            "course_name": "Raptor Ecology",
            "course_desc": "This course will examine the evolution, taxonomy, ecology, behavior, anatomy, physiology, and conservation of birds of prey of the world with emphasis on diurnal raptors, including those from Texas.  Field trips will include at least two overnight visits to significant migration and overwintering areas.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4331",
            "course_name": "Human Dimensions of Wildlife and Fisheries Conservation",
            "course_desc": "Humans play a role in nearly every aspect of wildlife and fisheries conservation. This course will provide students with principles, concepts, and case studies to understand how the human experience (e.g., culture, politics, economics) influences conservation outcomes. Students will also have an opportunity to integrate human dimensions into local decision-making. Prerequisite: BIO 4416 with a grade of \"D\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4332",
            "course_name": "Biology in Film and Television: An Analysis of the Biology in Fiction and Non-Fiction Film and TV",
            "course_desc": "This course explores how biology is portrayed in popular motion pictures with an emphasis on analyzing biological accuracy, misconceptions perpetuated or portrayed, and investigating the rationale behind motion picture directors' and writers' decisions about how they portray biological content in the final product. Students will watch and discuss a curated list of films and television shows and write an analysis of each film or TV episode. Prerequisite: BIO 1330 and BIO 1130 and BIO 1331 and BIO 1131 with grades of \"D\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n1 Lab Contact Hour\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4337",
            "course_name": "Biology and Conservation of Sharks",
            "course_desc": "This course examines the biology and conservation of sharks and their relatives (skates, rays, chimaeras, and sawfish). Topics to be examined include evolutionary history, distribution, anatomy and physiology, daily movements and migration, diet, reproduction, relationship with humans, fisheries, conservation, and field methods used in shark research. Prerequisite: BIO 1331 with a grade of C or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4338",
            "course_name": "Tropical Ecology and Conservation",
            "course_desc": "In this course students will obtain a first-hand knowledge of the ecology, biodiversity, conservation, and culture of tropical ecosystems. This is an immersive and intensive study abroad course combining traditional lecture, field-based instruction, and primary literature-based discussions while observing actual tropical ecosystems. Prerequisite: BIO 1130 and BIO 1131 and BIO 1330 and BIO 1331 all with grades of \"C\" or better and a minimum 2.5 Overall GPA.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4343",
            "course_name": "Fish Physiology",
            "course_desc": "This course examines the primary physiological functions in fish, including how fish sense and interact with the environment, maintain their energetic metabolism (respiration, digestion and excretion), reproduce and maintain water balance. Students will learn about the diverse adaptions fish use to cope with environmental and physiological challenges. Prerequisite:  BIO 2450 with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4350B",
            "course_name": "Biological Implications of Water Planning in Texas",
            "course_desc": "Current topics in understanding the biological implications of water planning in Texas. This course will be of particular interest to students who have a background in aquatic biology and who intend to stay in Texas post-graduation. May be repeated once with different emphasis.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4350D",
            "course_name": "Watershed Management Frameworks and Applications",
            "course_desc": "Introduction to integrated watershed assessment and management tools for identifying programmatic water quality and quantity issues and their root causes and solutions, and their practical application. The scientific and socio-economic elements are considered within the context of planning and developing watershed protection plans and programs. Prerequisite: Instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4350E",
            "course_name": "Techniques in Aquatic Biology",
            "course_desc": "This course will provide hands on experience with a suite of physical, chemical,\nand biological sampling techniques and gear used in applied river studies. Students will be exposed to the fundamentals of data quality objectives, accuracy, precision, detection limits, data visualization, exploratory analysis, univariate and multivariate statistics.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4350I",
            "course_name": "Bird Conservation and Management",
            "course_desc": "This course is an introduction to the conservation and management of bird populations in an ecological context.  Course covers a variety of species and spatial scales from landscape to ecoregion.  Laboratory portion will involve field trips, intensive computer-based labs, and class discussion. Corequisites: BIO 4416 with a grade of \"D\" or better.",
            "course_credits": "\n3 Credit Hours \n2 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4350J",
            "course_name": "Environmental Physiology of Animals",
            "course_desc": "This course is a study of how animals respond physiologically to changes in environmental temperature, moisture, salinity, partial pressure of gases, and toxins. Prerequisite: BIO 2450 with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4350K",
            "course_name": "Genomics",
            "course_desc": "The course is a lecture covering modern genomics, including principles of genome function, the human genome, comparative genomics, genome sequencing, evolution and genomic change, databases and medicine, ethical, legal and social issues. The course also includes discussion of transcriptomics, proteomics, metabolomics, directed evolution, protein design, and systems biology. Prerequisite: BIO 2450 with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4350M",
            "course_name": "Wildlife Policy and Law in North America",
            "course_desc": "This course provides the student with a historical and cultural context within which wildlife policy and law have developed in North America, particularly in the United States. Federal treaties, statutes, case law, and regulations pertaining to wildlife will be presented. Wildlife law from representative states will be referenced as well. Corequisite: BIO 4423 or BIO 4435 either with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4350P",
            "course_name": "Tropical Ecology and Conservation Lab",
            "course_desc": "This laboratory course complements the lecture course, in which students will obtain a first-hand knowledge of the ecology, biodiversity, conservation, and culture of tropical ecosystems. It is an immersive and intensive study abroad course combining traditional lecture and field-based laboratory instruction in tropical ecosystems.",
            "course_credits": "\n3 Credit Hours \n0 Lecture Contact Hours \n9 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4350Y",
            "course_name": "Introduction to Laboratory Research Methods",
            "course_desc": "This course is for students interested in undergraduate research and introduces the fundamental methods and practices utilized in biological research labs. This hands on course covers keeping a lab notebook, following standard protocols, and collecting/analyzing data. Student will be introduced to current research programs offered in the Biology department. Prerequisite: BIO 1330 and BIO 1331 both with grades of C or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4350Z",
            "course_name": "Diversity and Cultural Impact of Geoparks",
            "course_desc": "Students will explore biological differences in diversity across Geoparks in the United States and Ireland. Additionally, students will study the cultural impact that Geoparks have on the local community and national policy by focusing on differences between science communication strategies and community engagement practices conducted at the parks. Prerequisite: Instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4351A",
            "course_name": "Vertebrate Endocrinology",
            "course_desc": "This course teaches function and organization of the endocrine system. It describes the major endocrine glands, the synthesis and release of their hormone products, and the interaction with target tissues. Endocrine control of digestion, growth, reproduction, and homeostasis will be compared between mammals and other vertebrate groups.  Prerequisite: BIO 2450 and CHEM 2342 both with grades of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4351D",
            "course_name": "Ecology of Temporary Waters",
            "course_desc": "Temporary waters (which regularly go dry) are often overlooked. This course explores their diversity, their ecological role and how these systems are impacted by humans. We will also look at the species that rely on temporary waters, their special adaptations, and their populations and community dynamics.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4351E",
            "course_name": "Natural History of America",
            "course_desc": "In this field course students will examine the terrestrial and aquatic wildlife of a chosen study area in relation to their conservation and management. Local geology and climate change impacts on wildlife diversity will also be discussed. Prerequisite: BIO 1331 and BIO 1131 both with grades of C or better and a minimum 2.5 overall GPA and instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4351F",
            "course_name": "Marine Ecology and Conservation",
            "course_desc": "In this field course students will examine the ecology, management, and conservation of marine flora and fauna, and the impact of humans on marine life.   Prerequisite: BIO 1331 and BIO 1131 both with grades of C or better and a minimum 2.5 overall GPA and instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4351H",
            "course_name": "Natural History and Conservation of Large Mammals",
            "course_desc": "This course will introduce students to advanced details of natural history, research, and conservation of large mammals. Topics considered will include natural history, range and population status (historic and current), importance to and interaction with humans, research design and analysis, and the development of conservation and management plans.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4351I",
            "course_name": "Global Change Biology",
            "course_desc": "This course will give an in-depth analysis of the major global changes occurring in present day biological systems. The focus of the course will be on climate change, invasive species, eutrophication, land use change and biodiversity loss. Emphasis will be placed on peer-reviewed literature to better understand how biologists study processes at the global scale. Potential solutions to these global challenges will also be discussed. Prerequisite: BIO 2450 with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4351J",
            "course_name": "Comparative Immunology",
            "course_desc": "While most textbooks would present the immune system of animals as a monolith with little variation between species, we are quickly learning that this is not the case. Indeed animal immune systems are immensely diverse. This class will consist of a taxonomic survey of metazoan immune systems, focusing on the evolutionary causes and ecological consequences of this diversity in immune systems across animals. Prerequisite: BIO 4326 with a grade of \"D\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4351K",
            "course_name": "R for Biologists",
            "course_desc": "This course broadly introduces biologists to the programming language R for statistical computing. The course will focus on the programming aspects of R using Base-R and tidyverse. This includes fundamentals like accessing the RStudio environment; loading, analyzing, and visualizing data; declaring variables, as well as navigating through and installing new modules. Prerequisite:  BIO 2450 with a grade of C or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4351N",
            "course_name": "Marine Mammals, Reptiles, and Birds",
            "course_desc": "This course is a field course where students will examine the ecology, management, rehabilitation, and conservation of marine mammals, reptiles, and birds. The impact of humans (e.g., pollution, climate change, habitat destruction, transportation, tourism) on their survival and rules and regulations in place to protect them will also be evaluated.  Prerequisite: BIO 1331 and 1131 with a grade of C or better and Minimum 2.5 overall GPA and Instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4351P",
            "course_name": "Ecology and Conservation Abroad",
            "course_desc": "The purpose of this course is to provide a first-hand understanding of the natural history, biodiversity, ecology, and conservation of ecosystems that do not occur in the United States. It is an immersive and intensive study abroad course combining traditional lecture and field-based instruction in the field.    Corequisite: BIO 4351Q with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n20 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4351Q",
            "course_name": "Ecology and Conservation Abroad Lab",
            "course_desc": "The purpose of this course is to provide a first-hand understanding of the natural history, biodiversity, ecology, and conservation of ecosystems that do not occur in the United States. It is an immersive and intensive study abroad course combining traditional lecture and field-based instruction in the field.    Corequisite: BIO 4351P with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n0 Lecture Contact Hours \n20 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4360",
            "course_name": "Molecular Biology",
            "course_desc": "This course offers advanced insights into the realm of molecular biology. The curriculum covers a range of subjects such as gene expression (which encompasses the transcription and translation processes in bacteria and other organisms), post-translational protein modifications, chromosomal DNA replication, controls at cell cycle checkpoints, DNA damage and its repair mechanisms, and theories related to cancer and aging. Prerequisite: [BIO 2450 and BIO 2400] or CHEM 3375 or CHEM 4375, with grades of \"D\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4363",
            "course_name": "History of Medicine",
            "course_desc": "This course covers significant concepts, developments, individuals, and events in the history of medicine from antiquity to modern day. Topics include the impact of disease on medical practice, the development of hospitals as sites for care, teaching, and research, how medical science and technology are continuously defined by social, cultural, and political ideas, and the historical roots of several themes in medical ethics. This course will be delivered as an Education Abroad course. (WI) Prerequisite: BIO 2400 or BIO 2440 or BIO 2450 or BIO 2451 with a grade of C or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4364",
            "course_name": "Explorations in Physiology",
            "course_desc": "This course will cover the basic principles of physiological systems and the function of organ systems with an emphasis on humans and other mammals. The focus will be on the interplay between and among multiple organ systems and holistic systems integration.  Other topics include the pathophysiology underlying common diseases, drug therapies and treatments, and emerging physiological research. This course will also provide the opportunity for experiential learning gained in diverse cultural settings. Prerequisite: BIO 2400 or BIO 2440 or BIO 2450 or BIO 2451 with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4366",
            "course_name": "Medical Microbiology",
            "course_desc": "This lecture-based course will cover pathogenic bacteria and their relationship to disease, epidemiology and the biological basis for virulence. Students may take only one of BIO 4345, BIO 4350G or BIO 4445 for credit. Prerequisites: BIO 2400 and BIO 2450 both with grades of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4374",
            "course_name": "Principles of Zoo Management",
            "course_desc": "This course is designed to introduce the principles of captive animal management within conservation and education-based zoos. Zoo management requires a broad understanding of the life history and biological needs of many different species; we will explore the ways modern zoos address these needs and the ways in which future zoos could address them more effectively. Specific topics will include animal husbandry, welfare, nutrition, and behavior as well as environmental enrichment, captive breeding, conservation, zoo regulatory frameworks, ethical concerns, and zoo careers. Prerequisite: BIO 2411 with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4376",
            "course_name": "Microbial  Biotechnology",
            "course_desc": "This course provides an overview of how microbes (e.g., bacteria, viruses and yeast) are manipulated to solve practical problems through biotechnology. This course is based on topics of applied microbiology as recommended by American Society of Microbiology. Prerequisite: BIO 2400 and BIO 2450 both with grades of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4377",
            "course_name": "Genome Informatics",
            "course_desc": "The course will cover basic knowledge on genomics and its bioinformatics tools. Students will learn current topics on genomics and bioinformatics, and will analyze genomic data using statistical software.  All the analyses will be performed using a personal and a cluster computer. Prerequisite: BIO 2450 with a grade of C or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4388",
            "course_name": "Habitat Ecology",
            "course_desc": "The course will introduce students to the importance of habitat in understanding a wide range of processes and patterns in Ecology. Course will explore the process of habitat selection, in the context of animal behavior as well as population dynamics. Students will learn methods and techniques of statistically analyzing the habitat associations of species. The central role of habitat in species conservation will also be discussed. Prerequisite: BIO 4416 with \"C\" or better and instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4400",
            "course_name": "Plants Important for Wildlife",
            "course_desc": "This course explores plant and plant part (specifically gall, fruit, seed, and twig) identification, phylogenetics, co-evolution of plant defenses, economic and ecological impacts of plant uses by wildlife. Prerequisite: BIO 2410 or BIO 2450 either with a grade of \"C\" or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n2 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4402",
            "course_name": "Earth Science I",
            "course_desc": "The description and interpretation of earth phenomena considered from the standpoint of meteorology and astroscience. Includes field observations, methods of measurement and interpretation of data related to the physical environment and space technology. May not be counted toward a major or minor in biology. Required for those seeking grade 4-8 Science and Mathematics/Science certification.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4403",
            "course_name": "Earth Science II",
            "course_desc": "The description and interpretation of earth phenomena considered from the standpoint of geology and oceanography. Includes field observations, methods\nof sampling and interpretation of data related to the physical environment. May not be counted toward a major or a minor in biology. Required for those seeking grade 4-8 Science and Mathematics/Science certification.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4408",
            "course_name": "Science Processes and Research",
            "course_desc": "Students will analyze scientific research design, design research, interpret data, and communicate results.  Stress will be placed on broad-field structure and integration of major science concepts and research-based science pedagogy. This course must be taken the semester prior to student teaching and is required for those seeking 7-12 Life Science or Science teacher certification.  This course may not count as one of the four upper-level Biology courses required of general Biology majors, or one of the three upper-level Biology courses required of Biology minors.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4410",
            "course_name": "Field Biology of Plants",
            "course_desc": "Ecological relationships and natural history of plants, including historical geology,\ngeography, soils, vegetational regions and surface geology of central Texas. Emphasis is placed on plant-soil-water relationships to develop conservation concepts. Students will make a representative collection of plants. Prerequisite: BIO 2450 with a grade of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4411",
            "course_name": "Morphology of the Vascular Plants",
            "course_desc": "The structure, life-cycles and evolution of fossil and living vascular plants. Emphasis on such topics as the origin of land plants, evolution of the ovule, angiospermy, the flower and fruit. Prerequisites: BIO 2450 and CHEM 1342 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4412",
            "course_name": "Plant Anatomy",
            "course_desc": "The anatomy of vascular plants stressing descriptive, development and comparative aspects of seed plants and the anatomical adaptations of plants to environmental factors. Prerequisites: BIO 2450 and CHEM 1342 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4413",
            "course_name": "Parasitology",
            "course_desc": "The biology and biological significance of the common parasites of man and animals. Prerequisites: BIO 2411 and BIO 2450 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n4 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4415",
            "course_name": "Ichthyology",
            "course_desc": "An introduction to the morphology, taxonomy, natural history and evolution of fishes. Field trips will be made to collect specimens and laboratory periods will be devoted to morphological and systematic analysis. Prerequisites: BIO 2411 and BIO 2450 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4416",
            "course_name": "General Ecology",
            "course_desc": "The ecological relationships that exist between organisms and those relationships that exist between organism and environment. Laboratory sessions will be devoted to literature review and/or specific ecological problems. This course or BIO 4454 is required of all biology majors. (WI) Prerequisites: BIO 2450 and [BIO 2400 or BIO 2410 or BIO 2411] both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4418",
            "course_name": "Field Ornithology",
            "course_desc": "This course is designed to introduce and provide an advanced knowledge of the application of various field, laboratory, and statistical methods and techniques in the study of avian species.  The course will include topics related to survey methodology, sampling design, marking/banding, measurement/sample extraction, and aging/sexing of avian species.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4420",
            "course_name": "Natural History of the Vertebrates",
            "course_desc": "Environmental relationships and natural history of vertebrates. Emphasis is\nupon taxonomy, speciation and biotic provinces. The laboratory will include field trips for the study and collection of animals in their natural habitats. Students will assemble a representative collection of animals. (WI) Prerequisites: BIO 2411 and BIO 2450 both with grades of C or better and instructor approval.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4421",
            "course_name": "Ornithology",
            "course_desc": "Introduction to anatomy, behavior, ecology and identification of birds of Texas. Laboratory will emphasize field studies of birds and their habitat requirements.\nPrerequisites: BIO 2411 and BIO 2450 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4422",
            "course_name": "Mammalogy",
            "course_desc": "The taxonomy, distribution, ecology, behavior and evolution of mammals with particular emphasis on wild animals of the southwest. Laboratory will emphasize anatomy, identification, preparation of specimens and field exercises in the methods of population analysis. Prerequisites: BIO 2411 and BIO 2450 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4423",
            "course_name": "Wildlife Management",
            "course_desc": "Applications of the principles of ecology and natural history to the management of wildlife habitats and control of wildlife populations. Laboratory will involve demonstrations and practice exercises with wildlife management techniques and instrumentation and field trips to observe wildlife management projects. (WI) Prerequisites: BIO 2411 and BIO 2450 with grades of C or better and BIO 2410 with a grade of \"D\" or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4425",
            "course_name": "Biometry",
            "course_desc": "Basic principles of statistical methods as applied to biological problems such as sampling techniques, analysis of data, experimental design and population dynamics. Emphasis will be on practical application. Prerequisites: BIO 2450 and [MATH 1315 or MATH 2321 or MATH 2328 or MATH 2417 or MATH 2471] both with grades of \"C\" or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4429",
            "course_name": "Wetland Plant Ecology and Management",
            "course_desc": "This course focuses on the biological, physical, chemical, and ecological aspects of major wetland ecosystems. The management and restoration of wetlands will also be discussed. Special attention will be spent on the ecology and identification of wetland plants. Prerequisite: BIO 2410 or BIO 2450 either with a grade of \"C\" or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4431",
            "course_name": "Bacterial Diversity",
            "course_desc": "The overall goal of this research-based course is to isolate, cultivate, characterize, and identify under-explored bacterial lineages from environmental samples. Methods and techniques employed in this course include aseptic techniques, cutting-edge cultivation approaches, maintaining bacterial cultures, gel electrophoresis, DNA isolation, amplification, and sequencing. Prerequisite: BIO 2400 and BIO 2450 both with grades of \"C\" or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4432",
            "course_name": "Bacterial Genomics",
            "course_desc": "The course offers hands-on training on contemporary approaches, techniques, and bioinformatic tools used to study bacterial genomes. Topics covered include, DNA sequencing, genomic assembling, and annotation, with a strong emphasis in computation biology and genomic data handling/analytics. At the end of this course, students will be familiar with bioinformatics tools used to analyze genes and genomes. Prerequisite: BIO 4431 with a grade of \"C\" or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4434",
            "course_name": "Herpetology",
            "course_desc": "A course treating the origin and evolution of amphibians and reptiles; their reproductive and physiological tactics; taxonomy/systematics; and population\nbiology. Emphasis will be placed on North American species and those groups inhabiting Texas. Prerequisites: BIO 2411 and BIO 2450 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4435",
            "course_name": "Techniques in Wildlife Management",
            "course_desc": "The basic methodology of practical wildlife management. This involves\ntechniques in monitoring and data collection related to population dynamics and habitat parameters of wildlife species. Prerequisites: BIO 2411 and BIO 2450 both with grades of C or better and instructor approval.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4436",
            "course_name": "Tropical Biology",
            "course_desc": "This course entails an analysis and evaluation of the governing principles of tropical ecosystems, including wildlife ecologies, geological processes, and environmental-cultural interactions. In the laboratories, students will compare ecological relationships that influence tropical biology, discuss peer-reviewed literature and examine tropical flora and fauna during field trips to regional sub-tropical areas. Prerequisite: BIO 2410 and BIO 2411 and BIO 2450 all with grades of \"C\" or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4441",
            "course_name": "Cellular Physiology",
            "course_desc": "Advanced cellular biology, including membrane physiology, thermodynamics, energy transduction and distribution, and cellular movement in non-muscle and muscle cells. Laboratory includes discussion of current research and exercises in cellular physiology. (WI) Prerequisites: BIO 2450 and [CHEM 2330 or CHEM 2341 or CHEM 2342] both with grades of \"D\" or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4446",
            "course_name": "Microbial Ecology",
            "course_desc": "This course will illustrate the wide variety of bacteria in nature, their interactions with other organisms and the environments, and their roles in global cycling of elements such as carbon, nitrogen, and sulfur.  Undergraduate research is a major component of this course. (WI) Prerequisites: BIO 2400 and BIO 2450 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4447",
            "course_name": "Microbial Physiology",
            "course_desc": "This course will cover fundamental concepts in bacterial and archaeal physiology, including central and specialized metabolism. Undergraduate research is a major component of this course. (WI)  Prerequisites: BIO 2400 and BIO 2450 and CHEM 2142 and CHEM 2342 all with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4448",
            "course_name": "Bacterial Genetics",
            "course_desc": "This course will cover concepts and mechanisms involved in the genetics of Archaea and Bacteria. Prerequisite: BIO 2400 and BIO 2450 both with grades of \"C\" or better. (WI).",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n1 Lab Contact Hour\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4454",
            "course_name": "Plant Ecology",
            "course_desc": "Physiological ecology and community structure and function in the organization of terrestrial plant ecosystems. Quantitative vegetational sampling and the use of field and laboratory physiological equipment are included in the laboratory.  (WI) Prerequisite: BIO 2450 with a grade of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4455",
            "course_name": "Plant Physiology",
            "course_desc": "Basic principles of plant physiology are studied in lecture and laboratory. One semester of organic chemistry is strongly recommended. Prerequisite: BIO 2450 with a grade of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4464",
            "course_name": "Vertebrate Anatomy",
            "course_desc": "This course is a comparative study of vertebrate anatomy. Fossil histories are evaluated to understand how vertebrate radiation occurred in the geological past,along with changes in structure of organs and organ systems. Lab includes dissection of representative members of each major vertebrate group. Prerequisite: BIO 2450 with a grade of \"C\" or better. (WI).",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Dif Tui- Science & Engineering|Lab Required|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4465",
            "course_name": "General Entomology",
            "course_desc": "Principles of morphology, physiology and taxonomy of insects. Laboratory time will be devoted to a taxonomic study of the common orders and families of insects. Prerequisites: BIO 2411 and BIO 2450 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4470",
            "course_name": "Limnology",
            "course_desc": "The physical, chemical, and biological factors affecting productivity in lakes, ponds, and streams. Limnological sampling methods, chemical, and biological analysis of samples and hydrographic surveying are included in the laboratory. (WI) Prerequisites: BIO 2450 and CHEM 1342 both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4472",
            "course_name": "Animal Behavior",
            "course_desc": "This course presents all the major facets of the study of animal behavior, giving special attention to its evolution and ecological significance. We will discuss major conceptual models guiding past and present research in the field. Laboratories will emphasize experimental techniques and statistical analysis. (WI) Prerequisites: BIO 2450 and [BIO 2400 or BIO 2410 or BIO 2411] both with grades of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required|Writing Intensive",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4480",
            "course_name": "Cytology and Microtechnique",
            "course_desc": "A study of cellular structure and microscopic technique. The lecture portion of the course presents cytology of all cell types and theoretical aspects of microscopy including light and electron-based technologies. The laboratory portion of the course provides training in standard light and electron microscopy, laser scanning confocal microscopy, and digital microscopy. Prerequisite: BIO 2450 with a grade of C or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering|Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4481",
            "course_name": "Internship in Biological Laboratory Technologies",
            "course_desc": "The student will participate in the work of a selected biology unit (private, commercial, or governmental). A research paper, reporting the internship experience conducted at the biological unit under the supervision of a faculty member, will be required. This course may be credited toward a biology major with prior approval of the biology department adviser and chair. Prerequisite: BIO 2450 with a grade of C or better.",
            "course_credits": "\n4 Credit Hours \n0 Lecture Contact Hours \n15 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 4490",
            "course_name": "Principles of Developmental Biology",
            "course_desc": "This course will cover basic principles of developmental biology in both plant and animal systems. The course will mainly address cell, molecular and genetic mechanisms underlying the development of model organisms, mainly focusing on Drosophila (animal) and Arabidopsis (plant). Prerequisite:  BIO 2450 with grade of \"C\" or better.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5100",
            "course_name": "Professional Development",
            "course_desc": "This course is seminar-based and covers topics related to teaching, research, and employment responsibilities. Completion of the course is required as a condition of employment for graduate assistants. This course does not earn graduate degree credit. Repeatable with different emphasis. Graded on a credit (CR), no-credit (F) basis.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Graduate Assistantship|Exclude from Graduate GPA",
            "course_grademode": "Grade Mode: Leveling/Assistantships"
        },
        {
            "course_code": "BIO 5110",
            "course_name": "Seminar in Biology",
            "course_desc": "Interactive discussion of timely issues and problems, designed to expose students to the current literature in their fields of interest and its critical analysis. This course is repeatable for credit.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Header",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5114",
            "course_name": "Collaborative Research",
            "course_desc": "This course allows masters level graduate students to initiate, conduct, and participate in research in collaboration with graduate faculty of the Department of Biology that is in addition to thesis research conducted under BIO 5399A or BIO 5399B. This course recognizes the collaborative nature of scientific investigation. See also BIO 5214 and BIO 5314.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n1 Lab Contact Hour\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5166",
            "course_name": "Medical Microbiology Laboratory",
            "course_desc": "This graduate laboratory-based course will cover pathogenic bacteria emphasizing identification of selected groups of pathogens and the biological basis for virulence. Prerequisites: BIO 2400 and BIO 2450 both with grades of \"C\" or better.",
            "course_credits": "\n1 Credit Hour \n0 Lecture Contact Hours \n1 Lab Contact Hour\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5176",
            "course_name": "Microbial Biotechnology Laboratory",
            "course_desc": "This laboratory-based course will cover use of microbes for biotechnological applications and is designed to provide practical explorations into fields of biotechnology. Topics include laboratory techniques for recombinant protein purification, fermentation, identification of markers in genetically modified food and bio-remediation of pollutants. Corequisite: BIO 5376.",
            "course_credits": "\n1 Credit Hour \n0 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5199B",
            "course_name": "Thesis",
            "course_desc": "This course represents a students continuing thesis enrollments. The student continues to enroll in this course until the thesis is submitted for binding. Cannot be taken unless a Thesis Proposal has been submitted. Students working toward the M.A. or M.S. with a thesis are expected to enroll in thesis each semester in which faculty supervision is received or laboratory facilities are utilized.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Credit/No Credit"
        },
        {
            "course_code": "BIO 5214",
            "course_name": "Collaborative Research",
            "course_desc": "This course allows masters level graduate students to initiate, conduct, and participate in research in collaboration with graduate faculty of the Department of Biology that is in addition to thesis research conducted under BIO 5399A or BIO 5399B. This course recognizes the collaborative nature of scientific investigation. See also BIO 5314.",
            "course_credits": "\n2 Credit Hours \n2 Lecture Contact Hours \n2 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5295",
            "course_name": "Fundamentals of Research",
            "course_desc": "Designed to acquaint the beginning graduate student with materials and methods of research in the biological sciences. It is recommended that a graduate\nstudent take this course the first semester in residence.",
            "course_credits": "\n2 Credit Hours \n2 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5299B",
            "course_name": "Thesis",
            "course_desc": "This course represents a students continuing thesis enrollments. The student continues to enroll in this course until the thesis is submitted for binding. Cannot be taken unless a Thesis Proposal has been submitted. Students working toward the M.A. or M.S. with a thesis are expected to enroll in thesis each semester in which faculty supervision is received or laboratory facilities are utilized.",
            "course_credits": "\n2 Credit Hours \n2 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Credit/No Credit"
        },
        {
            "course_code": "BIO 5300",
            "course_name": "Neurobiology",
            "course_desc": "This course presents the biology of the nervous system with emphasis on the human nervous system. Topics presented in lecture include neuroanatomy, cellular neurobiology, neurophysiology, developmental neurobiology, and neuronal plasticity.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5301",
            "course_name": "Evolution",
            "course_desc": "Basic genetic principles applied to natural selection, adaptation, populations, and speciation. Consideration is given to the origin of life, nature of chromosomal\nvariation, evolution of genetic systems, and certain other selected topics.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n2 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5304",
            "course_name": "Wildlife and Recreation: Impact and Management",
            "course_desc": "Students will be introduced to the impact human recreational activities have on wildlife habitats and populations. Management practices to enhance human-wildlife encounters or to minimize detrimental effects on wildlife populations will be presented.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5305",
            "course_name": "Methods of Nature Study for Teachers",
            "course_desc": "This course provides a comprehensive survey of natural events.  It includes laboratory and field work emphasizing observation, collection and discovery of relationships. It is creditable only for those seeking elementary or middle school certification and is required for those seeking grade 4-8 Science or Science/Mathematics teaching certification.  This course must be taken the semester immediately prior to student teaching.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5307",
            "course_name": "Ecology of Rarity",
            "course_desc": "This course will examine the ecology of rarity and its ability to inform public awareness and environmental policy. This course will explore how we define rarity, persistence and viability. Is rarity more or less common than might be expected, and is there anything we can or should do about it?.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Dif Tui- Science & Engineering",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5311",
            "course_name": "Cancer Biology",
            "course_desc": "Cancer Biology provides a foundation for understanding the complex molecular, biochemical, and cellular processes associated with cancer development. Topics include the role of tumor suppressor genes, oncogenes, DNA repair, apoptosis, ECM, cell-cycle control, cell signaling pathways, immune function and cancer-causing viruses. Emerging diagnostics and/or therapeutics will also be discussed.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5314",
            "course_name": "Collaborative Research",
            "course_desc": "This course allows masters level graduate students to initiate, conduct, and participate in research in collaboration with graduate faculty of the Department of Biology that is in addition to thesis research conducted under BIO 5399A or BIO 5399B. This course recognizes the collaborative nature of scientific investigation.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5317",
            "course_name": "Interpretive Biology Programming and Design",
            "course_desc": "In this course, students will explore the methods and principles used by the National Park Service, museums, environmental centers, and state park systems to interest a variety of audiences as well as interpret biology and natural environments effectively. Students will practice skills in both personal and non-personal interpretation by creating science outreach programs, interpretive literature, brochures, path waysides, and other interpretive media.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5319C",
            "course_name": "Ecotoxicology",
            "course_desc": "Topics to be covered include sources, types, and fates of toxicants, organism response to toxicants, toxicant effects at the population, community, and ecosystem levels, and monitoring and risk assessment. Examination of current literature will form the core of the course.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5319F",
            "course_name": "Watershed Management Frameworks and Applications",
            "course_desc": "Introduction to integrated watershed assessment and management tools for identifying programmatic water quality and quantity issues and their root causes and solutions, and their practical application. The scientific and socio-economic elements are considered within the context of planning and developing watershed\nprotection plans and programs. Prerequisite: Instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5324",
            "course_name": "Natural History and Conservation of Large Mammals",
            "course_desc": "This course will introduce students to advanced details of natural history, research, and conservation of large mammals. Topics considered will include natural history, range and population status (historic and current), importance to and interaction with humans, research design and analysis, and the development of conservation and management plans.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5327",
            "course_name": "Issues in Irish Biodiversity and Conservation",
            "course_desc": "In this course, students will learn about Irish flora and fauna, ecosystems, conservation strategies in areas of high ecological concern, and public involvement. Emphasis will be placed on case studies and service-learning opportunities. Prerequisite: Instructor approval.",
            "course_credits": "\n3 Credit Hours \n1 Lecture Contact Hour \n3 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5328",
            "course_name": "Field Biology of Ireland",
            "course_desc": "In this course, students will use multiple techniques to explore biodiversity across multiple ecosystems in Ireland.  Prerequisite: Instructor approval.",
            "course_credits": "\n3 Credit Hours \n0 Lecture Contact Hours \n12 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5329",
            "course_name": "Raptor Ecology",
            "course_desc": "This course will examine the evolution, taxonomy, ecology, behavior, anatomy, physiology, and conservation of birds of prey of the world with emphasis on diurnal raptors, including those from Texas. Field trips will include at least two overnight visits to significant migration and overwintering areas.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5331",
            "course_name": "Human Dimensions of Wildlife and Fisheries Conservation",
            "course_desc": "Humans play a role in nearly every aspect of wildlife and fisheries conservation. This course will provide students with principles, concepts, and case studies to understand how the human experience (e.g., culture, politics, economics) influences conservation outcomes. Students will also have an opportunity to integrate human dimensions into local decision-making.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5332",
            "course_name": "Biology in Film and Television: An Analysis of the Biology in Fiction and Non-Fiction Film and TV",
            "course_desc": "This course explores how biology is portrayed in popular motion pictures with an emphasis on analyzing biological accuracy, misconceptions perpetuated or portrayed, and investigating the rationale behind motion picture directors' and writers' decisions about how they portray biological content in the final product. As part of this course students will watch and discuss a curated list of films and television shows and write an analysis of each film or TV episode.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n1 Lab Contact Hour\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5350G",
            "course_name": "Medical Microbiology",
            "course_desc": "This lecture-based course will cover pathogenic bacteria and their ability to cause disease, emphasizing the biological basis for virulence, and research strategies for investigating infectious diseases. Students may take only one of BIO 5350G or BIO 5445 for credit. Prerequisite: BIO 2400 with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5350I",
            "course_name": "Emerging Infectious Diseases",
            "course_desc": "Current topics in the emergence of viral and bacterial diseases in humans. This course will include new diseases, diseases previously seen and increasing in incidence, and diseases not previously seen in this country. This course will be of interest to students who are pursing advanced degrees and courses in microbiology, biochemistry, and cell and molecular biology.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5350J",
            "course_name": "Environmental Physiology of Animals",
            "course_desc": "This course is a study of how animals respond physiologically to changes in environmental temperature, moisture, salinity, partial pressure of gases, and toxins. Prerequisites: Instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5350K",
            "course_name": "Genomics",
            "course_desc": "The course is a lecture course in modern genomics, including principles of genome function, the human genome, comparative genomics, genome sequencing, evolution and genomic change, databases and medicine, ethical, legal and social issues. The course also includes discussion of transcriptomics, proteomics, metabolomics, directed evolution, protein design, and systems biology.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5350M",
            "course_name": "Wildlife Policy and Law in North America",
            "course_desc": "This course provides the student with a historical and cultural context within which wildlife policy and law (federal treaties, statutes, case law, and regulations) have developed in North America, particularly in the United States. Graduate students will research the development of Wildlife law in representative states as well.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5350O",
            "course_name": "Tropical Ecology and Conservation",
            "course_desc": "Students will obtain a first-hand knowledge of the ecology, biodiversity, conservation, and culture of tropical ecosystems. It is an immersive and intensive study abroad course combining traditional lecture and field-based laboratory instruction in tropical ecosystems.",
            "course_credits": "\n3 Credit Hours \n6 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5350P",
            "course_name": "Tropical Ecology and Conservation Lab",
            "course_desc": "This laboratory course complements the lecture course BIO 5350O, in which students will obtain a first-hand knowledge of the ecology, biodiversity, conservation, and culture of tropical ecosystems. It is an immersive and intensive study abroad course combining traditional lecture and field-based laboratory instruction in tropical ecosystems.  Corequisite: BIO 5350O.",
            "course_credits": "\n3 Credit Hours \n0 Lecture Contact Hours \n9 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5350Z",
            "course_name": "Diversity and Cultural Impact of Geoparks",
            "course_desc": "Students will explore biological differences in diversity across Geoparks in the United States and Ireland. Additionally, students will study the cultural impact that Geoparks have on the local community and national policy by focusing on differences between science communication strategies and community engagement practices conducted at the parks. Prerequisite: Instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5351G",
            "course_name": "Omics Approach to Microbiology",
            "course_desc": "This course covers contemporary approaches, techniques and bioinformatic tools used to study function and ecology in microbial communities. Topics covered will include microbiome, next-generation sequencing, metaproteomics, and their applications to clinical, agricultural, environmental and industrial needs.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n1 Lab Contact Hour\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5351I",
            "course_name": "Global Change Biology",
            "course_desc": "This course will give an in-depth analysis of the major global changes occurring in present day biological systems. The focus of the course will be on climate change, invasive species, eutrophication, land use change and biodiversity loss. Emphasis will be placed on peer-reviewed literature to better understand how biologists study processes at the global scale. Potential solutions to these global challenges will also be discussed.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5351J",
            "course_name": "Comparative Immunology",
            "course_desc": "While most textbooks would present the immune system of animals as a monolith with little variation between species, we are quickly learning that this is not the case. Indeed animal immune systems are immensely diverse. This class will consist of a taxonomic survey of metazoan immune systems, focusing on the evolutionary causes and ecological consequences of this diversity in immune systems across animals.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5351P",
            "course_name": "Ecology and Conservation Abroad",
            "course_desc": "The purpose of this course is to provide a first-hand understanding of the natural history, biodiversity, ecology, and conservation of ecosystems that do not occur in the United States. It is an immersive and intensive study abroad course combining traditional lecture and field-based instruction in the field.    Corequisite: BIO 5351Q with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n20 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5351Q",
            "course_name": "Ecology and Conservation Abroad Lab",
            "course_desc": "The purpose of this course is to provide a first-hand understanding of the natural history, biodiversity, ecology, and conservation of ecosystems that do not occur in the United States. It is an immersive and intensive study abroad course combining traditional lecture and field-based instruction in the field.    Corequisite: BIO 5351P with a grade of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n0 Lecture Contact Hours \n20 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5356",
            "course_name": "Plant Physiology",
            "course_desc": "Basic principles of plant physiology are studied in lecture and laboratory. Previous courses in biochemistry and genetics are strongly recommended.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5363",
            "course_name": "History of Medicine",
            "course_desc": "This course covers significant concepts, developments, individuals, and events in the history of medicine from antiquity to modern day. Topics include the impact of disease on medical practice, the development of hospitals as sites for care, teaching, and research, how medical science and technology are continuously defined by social, cultural, and political ideas, and the historical roots of several themes in medical ethics. This course will be delivered as an Education Abroad course.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5364",
            "course_name": "Explorations in Physiology",
            "course_desc": "This course will cover the basic principles of physiological systems and the function of organ systems with an emphasis on humans and other mammals. The focus will be on the interplay between and among multiple organ systems and holistic systems integration.  Other topics include the pathophysiology underlying common diseases, drug therapies and treatments, and emerging physiological research. This course will also provide the opportunity for experiential learning gained in diverse cultural settings.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5366",
            "course_name": "Medical Microbiology",
            "course_desc": "This lecture-based course will cover pathogenic bacteria and their relationship to disease, emphasizing critical evaluation of research literature, disease transmission and the biological basis for virulence. Prerequisites: BIO 2400 and BIO 2450 both with grades of \"C\" or better.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5374",
            "course_name": "Principles of Zoo Management",
            "course_desc": "This course is designed to introduce the principles of captive animal management within conservation and education-based zoos. Zoo management requires a broad understanding of the life history and biological needs of many different species; we will explore the ways modern zoos address these needs and the ways in which future zoos could address them more effectively. Specific topics will include animal husbandry, welfare, nutrition, and behavior as well as environmental enrichment, captive breeding, conservation, zoo regulatory frameworks, ethical concerns, and zoo careers.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5376",
            "course_name": "Microbial Biotechnology",
            "course_desc": "This course provides an overview of how microbes (e.g., bacteria, viruses and yeast) are manipulated to solve practical problems through biotechnology. This course design is based on topics of applied microbiology as recommended by American society of Microbiology.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5377",
            "course_name": "Genome Informatics",
            "course_desc": "The course will cover basic knowledge on genomics and its bioinformatics tools. Students will learn current topics on genomics and bioinformatics, and will analyze genomic data using statistical software.  All the analyses will be performed using a personal and a cluster computer.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5388",
            "course_name": "Habitat Ecology",
            "course_desc": "The course will emphasize and reinforce in students an appreciation for the importance of habitat in understanding a wide range of processes and patterns in Ecology. Course will explore the process of habitat selection, in the context of animal behavior, population dynamics, and modeling. Students will learn and apply methods and techniques of statistically analyzing the habitat associations of species. The central role of habitat in species conservation will also be discussed.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5390",
            "course_name": "Problems in the Biological Sciences",
            "course_desc": "Open to graduate students on an individual basis by arrangement with the faculty member concerned.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5399A",
            "course_name": "Thesis",
            "course_desc": "This course represents a students initial thesis enrollment. No thesis credit is awarded until student has completed the thesis in BIO 5399B. Students working toward the M.A. or M.S. with a thesis are expected to enroll in thesis each semester in which faculty supervision is received or laboratory facilities are used.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Credit/No Credit"
        },
        {
            "course_code": "BIO 5399B",
            "course_name": "Thesis",
            "course_desc": "This course represents a students continuing thesis enrollments. The student continues to enroll in this course until the thesis is submitted for binding. Cannot be taken unless a Thesis Proposal has been submitted. Students working toward the M.A. or M.S. with a thesis are expected to enroll in thesis each semester in which faculty supervision is received or laboratory facilities are utilized.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Credit/No Credit"
        },
        {
            "course_code": "BIO 5400",
            "course_name": "Plants Important for Wildlife",
            "course_desc": "This course explores plant and plant part (specifically gall, fruit, seed, and twig) identification, phylogenetics, co-evolution of plant defenses, economic and ecological impacts of plant uses by wildlife.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n2 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5402",
            "course_name": "Earth Science I",
            "course_desc": "A study of astronomy and meteorology through observation, description, and interpretation of earth phenomena. Includes field observations, methods of\nmeasurement and interpretation of data related to the physical environment and space technology. Requires independent scientific and science education research and presentation of findings in a professional context.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n4 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5403",
            "course_name": "Earth Science II",
            "course_desc": "The description and interpretation of earth phenomena considered from the standpoint of geology and oceanography. Includes field observations, methods of\nsampling and interpretation of data related to the physical environment. Requires independent scientific and science education research and presentation of findings in a professional context.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n4 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5408",
            "course_name": "Science Processes and Research",
            "course_desc": "Students will analyze scientific research design, design research, interpret data, and communicate results.  Stress will be placed on broad-field structure and integration of major science concepts and research-based science pedagogy. This course must be taken the semester prior to student teaching and is required for those seeking 7-12 Life Science or Science teacher certification.  This course may not count as one of the four upper-level Biology courses required of general Biology majors, or one of the three upper-level Biology courses required of Biology minors.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n4 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5410",
            "course_name": "Field Biology of Plants",
            "course_desc": "Ecological relationships and natural history of plants, including historical geology, geography, soils, and vegetational regions of Central Texas.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5411",
            "course_name": "Morphology of the Vascular Plants",
            "course_desc": "A phylogenetic survey of living and fossil vascular plants that focuses on external morphology and reproductive biology. Topics include phylogenetic reconstruction, the origin of vascular plants, seed reproduction, and the origin of angiosperms. Emphasis is on broad-scale evolutionary patterns and origin of major taxonomic groups.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5412",
            "course_name": "Plant Anatomy",
            "course_desc": "A descriptive and functional analysis of seed plants that focuses on internal structure. Topics include recognition and characterization of plant tissues, the structure of plant organs, and organ development. Emphasis is on pattern of tissue organization common to all seed plants and the functional basis for anatomical structure.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5413",
            "course_name": "Parasitology",
            "course_desc": "The biology and biological significance of the common parasites of man and animals.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n4 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5415",
            "course_name": "Ichthyology",
            "course_desc": "An introduction to the morphology, taxonomy, natural history, and evolution of fishes. Field trips will be made to collect specimens, and laboratory periods will be devoted to morphological and systematic analyses.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5418",
            "course_name": "Field Ornithology",
            "course_desc": "This course is designed to introduce and provide an advanced knowledge of the application of various field, laboratory, and statistical methods and techniques in the study of avian species.  The course will include topics related to survey methodology, sampling design, marking/banding, measurement/sample extraction, and aging/sexing of avian species.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5420",
            "course_name": "Natural History of the Vertebrates",
            "course_desc": "Environmental relationships and natural history of vertebrates. Emphasis is on evolution taxonomy, speciation, behavior, and morphology. Laboratory will include field trips for the study and collection of vertebrates in their natural habitats. Students will assemble a representative collection of vertebrates.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5421",
            "course_name": "Ornithology",
            "course_desc": "Introduction to anatomy, behavior, ecology, and identification of the birds of Texas. Laboratory will emphasize field studies of birds and their habitat requirements.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5422",
            "course_name": "Mammalogy",
            "course_desc": "The taxonomy, distribution, ecology, behavior, and evolution of mammals with particular emphasis on wild mammals of the Southwest. Laboratory will emphasize\nanatomy, identification, preparation of specimens, and field exercises in methods of population analysis. Students may assemble representative mammal collection.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5423",
            "course_name": "Wildlife Management",
            "course_desc": "Application of ecological principles and natural history concepts to the management of wildlife habitats and populations. Laboratory will involve\ndemonstrations and practice exercises with wildlife management techniques and instrumentation, and field trips to observe wildlife management projects.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5424D",
            "course_name": "Vertebrate Endocrinology",
            "course_desc": "This course teaches function and organization of the endocrine system. It describes the major endocrine glands, the synthesis and release of their hormone products, and the interaction with target tissues. Endocrine control of digestion, growth, reproduction, and homeostasis will be compared between mammals and other vertebrate groups.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n1 Lab Contact Hour\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5432",
            "course_name": "Bacterial Genomics",
            "course_desc": "The course will offer hands-on training on contemporary approaches, techniques, and bioinformatic tools used to study bacterial genomes. Topics covered include DNA sequencing, assembling and annotating genomes, all with a strong emphasis on computational biology. At the end of this course, students will be familiar with bioinformatics tools used to analyze genes and genomes.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5435",
            "course_name": "Techniques in Wildlife Management",
            "course_desc": "The basic methodology of practical wildlife management. This involves techniques in monitoring and data collection related to population dynamics and habitat parameters of wildlife species as well as field research.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5436",
            "course_name": "Tropical Biology",
            "course_desc": "This course entails an analysis and evaluation of the governing principles of tropical ecosystems, including wildlife ecologies, geological processes, and environmental-cultural interactions. In the laboratories, students will compare ecological relationships that influence tropical biology, discuss peer-reviewed literature and examine tropical flora and fauna during field trips to regional sub-tropical areas.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5441",
            "course_name": "Cellular Physiology",
            "course_desc": "Advanced cellular biology, including membrane physiology, thermodynamics, energy transduction and distribution, and cellular movement in non-muscle and\nmuscle cells. Laboratory includes discussion of current research and exercises in cellular physiology.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5443",
            "course_name": "Fish Physiology",
            "course_desc": "This course examines the primary physiological functions in fish including how fish sense and interact with the environment, maintain their energetic metabolism (respiration, digestion and excretion), reproduce and maintain water balance. Students will learn about the diverse adaptions fish use to cope with environmental and physiological challenges.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5448",
            "course_name": "Bacterial Genetics",
            "course_desc": "This course will cover concepts and mechanisms involved in the genetics of Archaea and Bacteria. Graduate students will learn current strategies dealing with traditional molecular genetics including post-transcriptional regulation involving small non-coding RNA. In addition graduate students will also write a critical review on a research article from relevant topic.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n1 Lab Contact Hour\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5454",
            "course_name": "Plant Ecology",
            "course_desc": "Functional ecology of terrestrial plants, plant populations, and communities. Laboratory emphasizes quantitative and experimental approaches to plant ecology and the use of field and laboratory physiology equipment.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5465",
            "course_name": "General Entomology",
            "course_desc": "Principles of morphology, physiology, and taxonomy of insects. Laboratory time will be devoted to a taxonomic study of the common orders and families of\ninsects.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5466",
            "course_name": "Phylogenetic Methods",
            "course_desc": "Reconstructing phylogenies is important in most fields of biology. Course emphasis is on practical data collection, management, and analysis. Laboratory\nexercises will introduce phylogenetic and DNA analysis software, and WWW resources. Students will learn how to address questions in their own research using phylogenetic methodologies.",
            "course_credits": "\n4 Credit Hours \n2 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5470",
            "course_name": "Limnology",
            "course_desc": "Physical, chemical, and biological factors affecting productivity in lakes, ponds, and streams. Limnology sampling methods, chemical and biological analysis of samples, and hydrographic surveying are included in the laboratory.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5472",
            "course_name": "Animal Behavior",
            "course_desc": "This course presents all the major facets of the study of animal behavior, giving special attention to its evolution and ecological significance. We will discuss major\nconceptual models guiding past and present research in the field. Laboratories will emphasize experimental techniques and statistical analysis.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5480",
            "course_name": "Cytology and Micro-technique",
            "course_desc": "Study of cellular ultra-structure and electron micro technique. Lecture portion of course will cover cytology of all cell types and theoretical aspects of light microscopy and electron microscopy. Laboratory portion will train students to proficiency in microscopy.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5481",
            "course_name": "Internship in Biological Laboratory Technologies",
            "course_desc": "The student will participate in the work of a selected biology unit (private, commercial, or governmental). A research paper reporting the internship experience conducted at the biological unit under the supervision of a faculty\nmember will be required. This course may be credited toward a biology major with prior approval of the graduate advisor and department chair.",
            "course_credits": "\n4 Credit Hours \n0 Lecture Contact Hours \n15 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5490",
            "course_name": "Principles of Developmental Biology",
            "course_desc": "This course will cover basic principles of developmental biology in both plant and animal systems. The course will mainly address cell, molecular and genetic mechanisms underlying the development of model organisms, mainly focusing on Drosophila (animal) and Arabidopsis (plant).",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 5599B",
            "course_name": "Thesis",
            "course_desc": "This course represents a students continuing thesis enrollments. The student continues to enroll in this course until the thesis is submitted for binding. Cannot be taken unless a Thesis Proposal has been submitted. Students working toward the M.A. or M.S. with a thesis are expected to enroll in thesis each semester in which faculty supervision is received or laboratory facilities are utilized.",
            "course_credits": "\n5 Credit Hours \n5 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Credit/No Credit"
        },
        {
            "course_code": "BIO 5999B",
            "course_name": "Thesis",
            "course_desc": "This course represents a students continuing thesis enrollments. The student continues to enroll in this course until the thesis is submitted for binding. Cannot be taken unless a Thesis Proposal has been submitted. Students working toward the M.A. or M.S. with a thesis are expected to enroll in thesis each semester in which faculty supervision is received or laboratory facilities are utilized.",
            "course_credits": "\n9 Credit Hours \n9 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Credit/No Credit"
        },
        {
            "course_code": "BIO 7100",
            "course_name": "Professional Development",
            "course_desc": "This course is seminar-based and covers topics related to teaching, research, and employment responsibilities. Completion of the course is required as a\ncondition of employment for graduate assistants. This course does not earn graduate degree credit. Repeatable with different emphasis.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Graduate Assistantship|Exclude from Graduate GPA",
            "course_grademode": "Grade Mode: Leveling/Assistantships"
        },
        {
            "course_code": "BIO 7102",
            "course_name": "Seminar in Aquatic Resources",
            "course_desc": "This course is an interactive discussion of timely issues and problems, designed to introduce students to the range of scientific, socioeconomic and policy issues likely to be encountered within the field of aquatic resources. All students seeking a doctoral degree in Aquatic Resources must enroll in BIO 7102 at least twice.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7103A",
            "course_name": "Ecology and Society",
            "course_desc": "Interactive discussion on relationships between society and the life-supporting ecosystems on which humans depend. Topics include roles of naturalsystems in social systems; effects of social, economic and political institutions on ecological systems and services; and the means by which humans develop and sustain desired ecological and social states.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7103B",
            "course_name": "Aquaculture",
            "course_desc": "The course comprises a survey of aquaculture production throughout the world. It also examines and discusses the impacts of aquaculture on nutrition, fisheries\nand the economy.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7103D",
            "course_name": "Molecular Biology of the Cell",
            "course_desc": "Interactive discussion of current literature on molecular biology of the cell. The course is designed to discuss concepts and their applications and methodology associated with the structure and function of the cell at cellular and molecular level.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7103E",
            "course_name": "Contemporary Problems in Ecology",
            "course_desc": "This course is an interactive discussion of the theoretical foundations and empirical basis for controversial topics in ecology, designed to develop critical thinking skills, and the ability to evaluate and integrate the biological, chemical and physical factors that affect the structure, functions, and interactions characterizing communities and ecosystems.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7103F",
            "course_name": "Molecular Genetics of Plant Development",
            "course_desc": "The study of plant development is rapidly changing as plant genome projects discover a multitude of new genes, and their expression and interaction patterns are understood. This course is designed to discuss concepts in plant development, and developmental processes as pathways of gene regulatory activities.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7103G",
            "course_name": "Ecohydrology",
            "course_desc": "A review of the concept of ecohydrology, its scientific foundation, and its ecological-hydrological linkages. Current topics in ecohydrology in the literature\nwill be discussed, including manipulation of biota and hydrology interactions in a landscape, and the possibility of augmenting the resilience of ecosystems to anthropogenic changes.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7103H",
            "course_name": "Integrated Waterbird Management",
            "course_desc": "This course focuses on the ecology and management of waterbirds, with an emphasis on the inland and coastal waterbirds of Texas. The basic ecology of waterbirds, waterbird management techniques, and waterbird habitat management will be discussed.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7103I",
            "course_name": "Avian Ecology and Evolution",
            "course_desc": "This course is an interactive discussion of avian ecology and evolution, providing students with a critical examination of theories, hypotheses, and lab and field-based data that support or refute there hypotheses. This course also discusses peerreviewed literature that challenges some paradigms in avian ecology and evolution.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7104",
            "course_name": "Marine Pollution",
            "course_desc": "In this course, students will read and discuss the scientific literature on the sources, bioaccumulation, trophic transfer, and health effects of contaminants in the marine environment. Papers will address a variety of marine life including plankton, crustaceans, mollusks, fishes, marine mammals, turtles, and birds. Contaminants to be reviewed include trace elements, PCBs, oil, pesticides, radionuclides, plastics, pharmaceuticals, illegal drugs, and personal care products.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7105",
            "course_name": "Environmental Issues through Documentaries",
            "course_desc": "In this course, students will examine how environmental issues are addressed in documentaries. Students will learn how to critically evaluate documentaries for scientific content, imagery, biases, and ease of understanding. Topics to be examined include overfishing, the wildlife trade, habitat degradation, pollution, energy resources, climate change, sustainability, and conservation.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7114",
            "course_name": "Collaborative Research",
            "course_desc": "This course (concurrent enrollment allowed) allows Ph.D. level graduate students to initiate, conduct, and participate in collaborative research with graduate faculty of the Department of Biology that is in addition to research conducted under BIO 7303, BIO 7399A, or BIO 7699A. This course recognizes the collaborative nature of scientific investigation.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n1 Lab Contact Hour\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7120",
            "course_name": "Population Biology Seminar",
            "course_desc": "This course facilitates exploration of current topics in population and conservation biology through reading and discussion of contemporary primary and secondary literature.",
            "course_credits": "\n1 Credit Hour \n2 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7199A",
            "course_name": "Dissertation",
            "course_desc": "Original research and writing in Aquatic Resources, to be accomplished under direct supervision of the dissertation advisor. While conducting dissertation research and writing, students must be continuously enrolled each long semester.",
            "course_credits": "\n1 Credit Hour \n1 Lecture Contact Hour \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Credit/No Credit"
        },
        {
            "course_code": "BIO 7214",
            "course_name": "Collaborative Research",
            "course_desc": "This course (concurrent enrollment allowed) allows Ph.D. level graduate students to initiate, conduct, and participate in collaborative research with graduate faculty of the Department of Biology that is in addition to research conducted under BIO 7303, BIO 7399A, or BIO 7699A. This course recognizes the collaborative nature of scientific investigation.",
            "course_credits": "\n2 Credit Hours \n2 Lecture Contact Hours \n2 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7299A",
            "course_name": "Dissertation",
            "course_desc": "Original research and writing in Aquatic Resources, to be accomplished under direct supervision of the dissertation advisor. While conducting dissertation research and writing, students must be continuously enrolled each long semester.",
            "course_credits": "\n2 Credit Hours \n2 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Credit/No Credit"
        },
        {
            "course_code": "BIO 7300",
            "course_name": "Communicating Science",
            "course_desc": "This course explores how to successfully disseminate science through visualizations, oral presentations, and written works to multiple audiences. Special emphasis will be placed on communicating with the general public, media, granting agencies, and science peers.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7301",
            "course_name": "College Science Teaching",
            "course_desc": "This course is designed for graduate students in the sciences who are interested in improving their science teaching and/or are interested in pursuing careers in academia. This course focuses on the central question, \"How do college students best learn science, and thus how do we best teach them?\".",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7302",
            "course_name": "Problems in Aquatic Resources",
            "course_desc": "Individual study on specific state, national, or international aquatic resources issues, under direct supervision of a doctoral or associate faculty member. Students may not enroll in BIO 7302 more than twice for doctoral credit without the approval of the Graduate Program Director.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7303",
            "course_name": "Research",
            "course_desc": "Research course for students who have not yet passed their Candidacy Exam, typically under direction of research-dissertation supervisor. Pre-candidacy students must enroll in course every semester until admission to Candidacy, although it may not be taken more than three times for doctoral credit without the approval of Graduate Program Director.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7308",
            "course_name": "History of Vegetation and Climate",
            "course_desc": "An overview of past vegetation and its relationship to changing climate. Topics include principles of paleovegetation analysis, paleoclimatology, the rise of flowering plants, vegetation during the age of dinosaurs, the rise of the\ngrasslands, and the Quaternary Ice Age. Prerequisites: Instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n1 Lab Contact Hour\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7310",
            "course_name": "Global Aquatic Resources",
            "course_desc": "Introduction to global, national, and regional aquatic resource issues, including scientific, environmental policy and socioeconomic components and perspectives. Water quantity and quality issues and their root causes in different regions of the world are examined, with an emphasis on case studies.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7311",
            "course_name": "Ecology of Temporary Waters",
            "course_desc": "The course explores the diversity of temporary bodies of water and of the species that rely on them, including their special adaptations, population and community dynamics, the ecological role of temporary waters, and how these systems are impacted by humans. Background coursework or independent study in ecology is recommended.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7314",
            "course_name": "Collaborative Research",
            "course_desc": "This course (concurrent enrollment allowed) allows Ph.D. level graduate students to initiate, conduct, and participate in collaborative research with graduate faculty of the Department of Biology that is in addition to research conducted under BIO 7303, BIO 7399A, or BIO 7699A. This course recognizes the collaborative nature of scientific investigation.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7324",
            "course_name": "Natural History and Conservation of Large Mammals",
            "course_desc": "This course will introduce students to advanced details of natural history, research, and conservation of large mammals. Topics considered will include natural history, range and population status (historic and current), importance to and interaction with humans, research design and analysis, and the development of conservation and management plans.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7326",
            "course_name": "Immunobiology",
            "course_desc": "This lecture-based course will cover the mechanisms and biology of the innate and adaptive immune system. Emphasis will include relationship to cancer, transplantation, hypersensitivity (allergy), and disease. Students will evaluate current research in immunology.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7327",
            "course_name": "Ecological Immunology",
            "course_desc": "This course explores the roles of immunity in natural ecosystems, focusing on central concepts in ecological immunology. From viruses to parasites, pathogenic threats are omnipresent. As epizootic outbreaks become more common, it is important to integrate immunological knowledge with traditional ecological perspectives. Background coursework in immunology is recommended.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7331",
            "course_name": "Human Dimensions of Wildlife and Fisheries Conservation",
            "course_desc": "This course will provide principles, concepts, and case studies to understand how the human experience (e.g., culture, politics, economics) influences conservation outcomes. Students will have an opportunity to integrate human dimensions into decision-making.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7332",
            "course_name": "Introduction to R Programming for Biologists",
            "course_desc": "This course introduces the programming language R. The course will focus on best practices in programming and the use of Base-R and RStudio. Topics include navigating the R and RStudio environment, installing packages, loading, manipulating, and visualizing data, declaring variables, writing loops, and writing functions.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7333",
            "course_name": "Phylogenetic Comparative Methods",
            "course_desc": "This course introduces students to modern phylogenetic comparative methods and teaches how to perform them. Topics include constructing phylogenies, dating phylogenies, finding and using previously published phylogenetic datasets, phylogenetic data visualization, and a variety of methods to test ecological and evolutionary hypotheses in a phylogenetic framework.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7336",
            "course_name": "Evolutionary Ecology",
            "course_desc": "This course will use an evolutionary perspective to explore questions provided by natural selection and sexual selection through assessment of current theory and research related to topics such as competition, coevolution, and phenotypic plasticity. Students will achieve comprehension and familiarity with the field through discussions and writing.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7342",
            "course_name": "Virology",
            "course_desc": "This course examines the structure, multiplication and genetics of bacterial, plant, and animal viruses as well as the role of viruses in human and plant disease. Students are expected to become familiar with the research literature in virology.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7346",
            "course_name": "Conservation Biology",
            "course_desc": "Examination of the alteration of habitats and associated biological changes threatening the continued existence of species and basic ecosystems. Topics include conservation ethics, working paradigms, levels and loss of global biodiversity, conservation at population and ecosystem levels, restoration ecology, endangered species biology and conservation laws. Recent Advances are stressed.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7353",
            "course_name": "Biogeography",
            "course_desc": "Examines historical and ecological explanations of the geographic distribution of organisms including the role of geologic, climatic, and biologic changes.\nEmphasizes the historical and philosophical development of the science and modern methods of analysis.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n1 Lab Contact Hour\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7354",
            "course_name": "Applied Analyses of Populations",
            "course_desc": "In this course students will learn and apply a variety of statistical techniques for analyzing populations. They will build code to conduct and compare statistical analyses as they apply to real population data. Students will use real-world data sets to generate objectives and test hypotheses including conducting all data visualization and validations, performing models, selecting appropriate models, and estimating latent variables and their predictors. Analyses include assessing the effects of environmental attributes on occupancy, relative abundance, abundance, space (habitat) use, home range size, local colonization, local extinction, survival, and recruitment.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7355",
            "course_name": "Plant-Water Relations",
            "course_desc": "Examination of the physiology and ecology of water use in higher plants, including the uptake, utilization, and movement of water, transpiration and adaptation to variable water availability including drought, and the ecological role of water in\nstructuring plant communities.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360A",
            "course_name": "Industry and Sustainable Aquatic Resources",
            "course_desc": "Examination of industrial water needs and uses, the types and quantities of water pollutants produced by different industries, problems faced by industry regarding process water for different manufacturing activities, and the possibilities for industry to contribute to the goal of sustainable aquatic resources.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360B",
            "course_name": "Environmental Linkages and Sustainable Aquatic Resources",
            "course_desc": "Introduction to the environmental relationships between humans and other living beings and the ecological systems in which they exist. Emphasis will be on the potential for individual environmental problems to have serious impacts on other environmental components, as well as the nature of these impacts.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360C",
            "course_name": "Role of State and Federal Courts in Protection and Maintenance of Aquatic Resources",
            "course_desc": "Examination of current or emerging state, national and international aquatic resources issues, including root causes and their human and ecosystem interactions. The course may be repeated for credit, depending on the topic. No more than six hours can be counted for doctoral credit without the approval of the Program Director.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360D",
            "course_name": "Evolutionary Ecology",
            "course_desc": "Examination of current or emerging state, national and international aquatic resources issues, including root causes and their human and ecosystem interactions. The course may be repeated for credit, depending on the topic. No more than six hours can be counted for doctoral credit without the approval of the Program Director.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360E",
            "course_name": "Advances in Water Quality Investigations",
            "course_desc": "Examination of current or emerging state, national and international aquatic resources issues, including root causes and their human and ecosystem interactions. The course may be repeated for credit, depending on the topic. No more than six hours can be counted for doctoral credit without the approval of the Program Director.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360F",
            "course_name": "Approaches to Aquatic Resource Modeling",
            "course_desc": "Examination of current or emerging state, national and international aquatic resources issues, including root causes and their human and ecosystem interactions. The course may be repeated for credit, depending on the topic. No more than six hours can be counted for doctoral credit without the approval of the Program Director.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360G",
            "course_name": "Molecular Techniques in Microbial Ecology",
            "course_desc": "Lectures on molecular techniques used to analyze structure and function of uncultured microbial communities in the environment with selected examples of applications.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360H",
            "course_name": "Parasites and Diseases of Fishes and Other Aquatic Animals",
            "course_desc": "Examination of current or emerging state, national and international aquatic resources issues, including root causes and their human and ecosystem interactions.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Lab Required|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360I",
            "course_name": "Bayesian Statistics for Biology",
            "course_desc": "This course examines the theory and mathematical foundations of Bayesian statistics and provides instruction and experience conducting Bayesian analyses using computer-based procedures.  The course emphasizes practical applications for Bayesian statistical procedures for problems in biological sciences.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360K",
            "course_name": "Evolution",
            "course_desc": "Examination of current or emerging state, national and international aquatic resources issues, including root causes and their human and ecosystem interactions. The course may be repeated for credit, depending on the topic. No more than six hours can be counted for doctoral credit without the approval of the Program Director.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360L",
            "course_name": "Landscape and Biogeography of Texas",
            "course_desc": "Examination of current or emerging state, national and international aquatic resources issues, including root causes and their human and ecosystem interactions. The course may be repeated for credit, depending on the topic. No more than six hours can be counted for doctoral credit without the approval of the Program Director.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360P",
            "course_name": "Regulation of Plant Growth and Development",
            "course_desc": "Examination of current or emerging state, national and international aquatic\nresources issues, including root causes and their human and ecosystem interactions. The course may be repeated for credit, depending on the topic. No more than six hours can be counted for doctoral credit without the approval of the Program Director.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360Q",
            "course_name": "Spatial Ecology of Animals",
            "course_desc": "Examination of current or emerging state, national and international aquatic resources issues, including root causes and their human and ecosystem interactions. The course maybe repeated for credit, depending on the topic. No more than six hours can be counted for doctoral credit without the approval\nof the Program Director.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360R",
            "course_name": "Community and Ecosystem Ecology",
            "course_desc": "Examination of current or emerging state, national and international aquatic resources issues, including root causes and their human and ecosystem interactions. The course may be repeated for credit, depending on the topic. No more than six hours can be counted for doctoral credit without the approval of the Program Director.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360S",
            "course_name": "Soil Biology",
            "course_desc": "An introduction to the biology of soil systems, including the roles of biota in forming and maintaining soils, and the interactions between biotic and abiotic components in soils.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360T",
            "course_name": "Karst Hydrogeology and Geomorphology",
            "course_desc": "An introduction to, and advanced understanding of, karst hydrogeology, geology, and geomorphology, with emphasis on field and theoretical applications of this information to the study of karst systems, and recognition and understanding of karst landforms at the surface and their relationships with subsurface processes. Prerequisite: Instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360U",
            "course_name": "Sustainability in a Changing World",
            "course_desc": "Understanding the ecological-social interface, including policies, product development and actions towards sustainability, with emphasis on\nintegrating and implementing theories and methods across disciplines, and improving the knowledge and experience base for public policy and decision-making regarding human-environment linkages within the context of sustainable development. Prerequisite: Instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360V",
            "course_name": "Techniques in Aquatic Biology",
            "course_desc": "The course will provide hands on experience with a suite of physical, chemical, and biological sampling techniques and gear used in applied river studies. Students will be exposed to the fundamentals of data quality objectives, accuracy,\nprecision, detection limits, data visualization, exploratory analysis, univariate and multivariate statistics.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7360Y",
            "course_name": "Applied Bioinformatics",
            "course_desc": "This course provides an introduction to scripting and other computational techniques used for visualizing and analyzing large biological datasets. Computational techniques include sequence and structural alignment, data mining, phylogenetic tree construction, and data clustering using UNIX, Python, and R. Students will gain a solid foundation in broadly applicable bioinformatics skills.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7361A",
            "course_name": "Discipline-Based Educational Research Methods",
            "course_desc": "This course will expose science graduate students to educational research in a practical setting, supervised by a professor experienced in conducting discipline-based educational research, focusing primarily on qualitative methods.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7361C",
            "course_name": "Advanced Genomics and Bioinformatics",
            "course_desc": "This course provides hands-on experience in processing and analyzing data produced from contemporary genomics tools for thesis students with basic bioinformatics training. Prerequisite: BIO 7360Y with a grade of \"B\" or better and instructor approval.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7361D",
            "course_name": "Raptor Ecology",
            "course_desc": "This course will examine the evolution, taxonomy, ecology, behavior, anatomy, physiology, and conservation of birds of prey of the world with emphasis on diurnal raptors, including those from Texas. Field trips will include at least two overnight visits to significant migration and over wintering areas.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Exclude from 3-peat Processing|Topics",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7399A",
            "course_name": "Dissertation",
            "course_desc": "Original research and writing in Aquatic Resources, to be accomplished under direct supervision of the dissertation advisor. While conducting dissertation\nresearch and writing, students must be continuously enrolled each semester (including summer) for at least three dissertation hours.",
            "course_credits": "\n3 Credit Hours \n3 Lecture Contact Hours \n5 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Credit/No Credit"
        },
        {
            "course_code": "BIO 7402",
            "course_name": "Molecular Field Techniques",
            "course_desc": "The application of molecular tools for identifying, quantifying, and interpreting biological diversity assessments in aquatic systems. The course focuses on micro organismal identification and vertebrate model systems.",
            "course_credits": "\n4 Credit Hours \n0 Lecture Contact Hours \n4 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7405",
            "course_name": "Statistics and Experimental Design I",
            "course_desc": "Introduction to inferential statistics, including exploratory and confirmatory data analysis, estimation and hypothesis testing, analysis of variance and regression, and non-parametric techniques, as applied to aquatic resource issues. Computer\napplications emphasized.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7406",
            "course_name": "Statistics and Experimental Design II",
            "course_desc": "Introduction to the principles of experimental design, including randomization, replication, sample-size determination, completely randomized and randomized block design, factorial design, repeated measure design, and analysis of variance and covariance, as applied to aquatic resource issues. Computer applications emphasized. Prerequisite: BIO 7405 with a grade of \"C\" or better or instructor approval.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7410",
            "course_name": "Aquatic Microbial Ecology",
            "course_desc": "Examination of microbial organisms, communities, and interactions affecting the form, structure, and functional aspects of aquatic ecosystems. Field trips may be required. Prerequisite: BIO 2400 with a grade of \"D\" or better or instructor approval.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7412",
            "course_name": "Environmental Hydrology",
            "course_desc": "Overview of the properties, distribution, and movement of water over and under the land surface and its relation to sustainable aquatic ecosystems,\nincluding quantitative methods to assess cumulative impacts of human activities on such systems. Field trips may be required. Knowledge of calculus recommended.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7414",
            "course_name": "Ecology of Infectious Diseases of Wildlife",
            "course_desc": "Concepts of the ecology of infectious diseases in wildlife are studied in depth with emphasis on their application to the management and conservation of wildlife species and for the control of zoonotic diseases. Prerequisite: Instructor approval.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7419",
            "course_name": "Stream Ecology",
            "course_desc": "Study of ecological theories, concepts, and processes occurring at the population, community, and ecosystem levels of organization in running water. Laboratory includes sampling methods, descriptive and comparative studies, experiments, and critical discussion of literature. Field trips may be required.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7426",
            "course_name": "Ecology and Management of Aquatic Macrophytes",
            "course_desc": "Examination of aquatic macrophytes and their ecology, taxonomy, distribution and management. Field trips may be required.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7427",
            "course_name": "Principles of Population Biology I",
            "course_desc": "This course provides a foundation in theory and mathematics of basic population biology. The course is divided into modular components, including defining evolutionarily significant units, ecology of populations, genetics of populations, and evolutionary genetics. A background in genetics and general ecology is recommended.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7428",
            "course_name": "Principles of Population Biology II",
            "course_desc": "This course provides a foundation in theory and mathematics of basic population biology. The course is divided into modular components which include: 1) Ecology of Communities, 2) Evolution of Behavior, 3) Phylogenetic Methods, and 4) Biological Diversity and Conservation Biology.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7430",
            "course_name": "Mycology",
            "course_desc": "This course provides an introduction to the organisms in the Kingdom Fungi and to fungus-like organisms, their ecology and evolution, and their role in industry and disease. Special emphasis will be placed on morphology, culturing, and using laboratory techniques for identification.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7433",
            "course_name": "Population Genetics",
            "course_desc": "This course examines the theoretical foundations of population genetics, including the description of population genetic structure and the forces creating it. The course emphasizes application of principles to a wide range of current problems in evolution, systematics and ecology. Molecular methods, data interpretation and computer-based data analysis are emphasized.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n2 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7434",
            "course_name": "Herpetology",
            "course_desc": "A course treating the origin and evolution of amphibians and reptiles; their reproductive and physiological tactics; taxonomy/systematics; and population biology. While cosmopolitan in scope, emphasis will be placed on North American species and those groups inhabiting Texas.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7440",
            "course_name": "Aquatic Toxicology",
            "course_desc": "Introduction to principles for identifying and assessing the adverse effects of chemicals and other compounds and mixtures on aquatic organisms and\necosystems.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7447",
            "course_name": "Microbial Physiology",
            "course_desc": "Prokaryotes, including bacteria and archaea, are the most diverse group of organisms on earth. Many prokaryotes live in environments which are inhospitable to other life forms. This course covers major aspects of prokaryotic physiology that permit them to be so successful.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7466",
            "course_name": "Phylogenetics",
            "course_desc": "Study of the use of phylogenetic methodologies in aquatic research, including practical data collection, management, and analysis in the reconstruction of\nphylogenies. Laboratory exercises will introduce phylogenetic and DNA analysis software. Prerequisite: BIO 2450 and BIO 4369 and BIO 5466 all with grades of \"C\" or better or instructor approval.",
            "course_credits": "\n4 Credit Hours \n2 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7468",
            "course_name": "Groundwater Resources",
            "course_desc": "Study of the geological, physical, chemical and biological factors influencing sustainable groundwater resources, including hydrologic linkages and \ninteractions with surface aquatic resources. Emphasis will be on the karst aquifer systems of Central Texas, and other groundwater aquifer systems of the United States.",
            "course_credits": "\n4 Credit Hours \n3 Lecture Contact Hours \n3 Lab Contact Hours\n",
            "course_attributes": "Course Attribute(s): Lab Required",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7469",
            "course_name": "Introduction to Ecological Modeling",
            "course_desc": "Mathematical models range from simple conceptual models to complex mechanistic models for mimicking behavior of natural systems. This course provides a broad overview of modeling objectives, techniques and assumptions, as well as the practical skills needed to conduct modeling projects. Computer applications emphasized. Prerequisite: MATH 2471 with a grade of \"C\" or better or instructor approval.",
            "course_credits": "\n4 Credit Hours \n2 Lecture Contact Hours \n2 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Standard Letter"
        },
        {
            "course_code": "BIO 7599A",
            "course_name": "Dissertation",
            "course_desc": "Original research and writing in Aquatic Resources, to be accomplished under direct supervision of the dissertation advisor. While conducting dissertation research and writing, students must be continuously enrolled each long semester.",
            "course_credits": "\n5 Credit Hours \n5 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Credit/No Credit"
        },
        {
            "course_code": "BIO 7699A",
            "course_name": "Dissertation",
            "course_desc": "Original research and writing in Aquatic Resources, to be accomplished under direct supervision of the dissertation advisor. While conducting dissertation\nresearch and writing, students must be continuously enrolled each semester (including summer) for at least three dissertation hours.",
            "course_credits": "\n6 Credit Hours \n6 Lecture Contact Hours \n10 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Credit/No Credit"
        },
        {
            "course_code": "BIO 7999A",
            "course_name": "Dissertation",
            "course_desc": "Original research and writing in Aquatic Resources, to be accomplished under direct supervision of the dissertation advisor. While conducting dissertation research and writing, students must be continuously enrolled each long semester.",
            "course_credits": "\n9 Credit Hours \n9 Lecture Contact Hours \n0 Lab Contact Hours\n",
            "course_attributes": "",
            "course_grademode": "Grade Mode: Credit/No Credit"
        }
    ]
}